#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖Success! The configuration is valid.


#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.azure_virtual_network.azurerm_virtual_network.main_vnet will be created
  + resource "azurerm_virtual_network" "main_vnet" {
      + address_space       = [
          + "10.5.0.0/16",
        ]
      + dns_servers         = []
      + guid                = (known after apply)
      + id                  = (known after apply)
      + location            = "eastus"
      + name                = "vnet-mybob336-client-use-prod-001"
      + resource_group_name = "rg-mybob336-client-prod-001"
      + subnet              = (known after apply)
      + tags                = {
          + "CostCenter"  = "0088"
          + "Criticality" = "High"
          + "Entity"      = "DE"
          + "Owner"       = "Bob Tayara"
          + "env"         = "prod"
          + "stack"       = "mybob336"
        }
    }

  # module.rg.azurerm_resource_group.main_rg will be created
  + resource "azurerm_resource_group" "main_rg" {
      + id       = (known after apply)
      + location = "eastus"
      + name     = "rg-mybob336-client-prod-001"
      + tags     = {
          + "env"   = "prod"
          + "stack" = "mybob336"
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.
```

</details>

*Pusher: @ibrt2016, Action: `pull_request`, Workflow: `Terraform Plan`*